Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id                             = (known after apply)
      + name                           = "ssb-solr-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "07996909-c99a-4f7b-b154-4330e363693b"
      + space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "60m"
          + delete = "40m"
          + update = "90m"
        }
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "01473bf6-f118-4d74-951a-d0bfed470d91"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "rV1qiROKRbacrN2Whbidd6KrRZSsTJfU3RArsNcpjxI=" -> "pyX/oCezxIthNRXW/E8TTCbN0bY0NkXu8xbvNAC5ZyI="
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "fda449c0-a864-48f5-bdb6-bbd9d54fd0b4"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
        # (19 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #127](https://github.com/GSA/datagov-ssb/actions/runs/1496334537)